In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
%cd '/content/drive/My Drive/Colab Notebooks/db'
!ls

/content/drive/My Drive/Colab Notebooks/db
API_19_DS2_en_csv_v2_1926515.csv		 groups_sitc_rev2.csv
API_AG.LND.AGRI.K2_DS2_en_csv_v2_1927122.csv	 london_merged.csv
API_AG.LND.FRST.K2_DS2_en_csv_v2_1927168.csv	 Meteorite_Landings.csv
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_1927784.csv  poblacion.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_1926651.csv	 products.json
API_SP.POP.TOTL_DS2_en_csv_v2_1976634.csv	 products_sitc_rev2.csv
colombia_exports.csv				 test.csv
colombia_imports.csv				 text.hdf
country_names.csv				 text.json
covid_19_data.csv				 text.parquet
diabetes.csv					 text.pkl
fake-company.csv				 text.xlsx
GlobalLandTemperaturesByCountry.csv		 titanic.csv
goog-1.csv					 year_origin_sitc_rev2.tsv

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('titanic.csv')

In [ ]:
df_titanic = df.copy(deep=True)

In [ ]:
df_titanic.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [ ]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df_titanic.shape

(891, 12)

In [ ]:
df_titanic[df_titanic.index == 148]

     PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
148          149         0       2  ...  26.0    F2         S

[1 rows x 12 columns]

In [ ]:
df_titanic[df_titanic.index %2 == 0]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
6              7         0       1  ...  51.8625   E46         S
8              9         1       3  ...  11.1333   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
882          883         0       3  ...  10.5167   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[446 rows x 12 columns]

In [ ]:
df_titanic[df_titanic['Pclass']==1].sort_values('Name')

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
730          731         1       1  ...  211.3375       B5         S
305          306         1       1  ...  151.5500  C22 C26         S
297          298         0       1  ...  151.5500  C22 C26         S
498          499         0       1  ...  151.5500  C22 C26         S
460          461         1       1  ...   26.5500      E12         S
..           ...       ...     ...  ...       ...      ...       ...
155          156         0       1  ...   61.3792      NaN         C
351          352         0       1  ...   35.0000     C128         S
55            56         1       1  ...   35.5000      C52         S
555          556         0       1  ...   26.5500      NaN         S
325          326         1       1  ...  135.6333      C32         C

[216 rows x 12 columns]

In [ ]:
df_titanic['Survived'].value_counts()/df_titanic.shape[0]

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [ ]:
df_titanic['Ones'] = 1

In [ ]:
df_count = df_titanic.groupby(['Pclass','Survived'])['Ones'].count()

In [ ]:
df_sum = df_titanic.groupby(['Pclass'])['Ones'].sum()

In [ ]:
df_count.apply(lambda x: 100*x/df_sum)

Pclass                    1           2          3
Pclass Survived
1      0          37.037037   43.478261  16.293279
       1          62.962963   73.913043  27.698574
2      0          44.907407   52.717391  19.755601
       1          40.277778   47.282609  17.718941
3      0         172.222222  202.173913  75.763747
       1          55.092593   64.673913  24.236253

In [ ]:
def survivedByClass(df):
  for i in [1,2,3]:
    df_count = df_titanic[df_titanic['Pclass'] == i].groupby('Survived')['Ones'].count()
    df_sum =  df_count.sum()
    percentage = df_count.apply(lambda x: 100*x/df_sum).to_frame()
    percentage.rename(columns={'Ones':'Percentage'}, inplace=True)
    print(f'Class {i}')
    print(percentage)

In [ ]:
survivedByClass(df_titanic)

Class 1
          Percentage
Survived
0          37.037037
1          62.962963
Class 2
          Percentage
Survived
0          52.717391
1          47.282609
Class 3
          Percentage
Survived
0          75.763747
1          24.236253

In [ ]:
df_titanic.dropna(subset =['Age'], inplace=True)

In [ ]:
df_titanic[df_titanic['Sex']=='female'].groupby('Pclass')['Age'].mean().to_frame()

              Age
Pclass
1       34.611765
2       28.722973
3       21.750000

In [ ]:
df_titanic['Menor_Edad']= df_titanic['Age'].apply(mayorEdad)

In [ ]:
def mayorEdad (x):
  if x < 18:
    return 1
  else:
    return 0

In [ ]:
def menorEdadByClass(df):
  for i in [1,2,3]:
    df_count = df_titanic[df_titanic['Pclass'] == i].groupby('Menor_Edad')['Ones'].count()
    df_sum =  df_count.sum()
    percentage = df_count.apply(lambda x: 100*x/df_sum).to_frame()
    percentage.rename(columns={'Ones':'Percentage'}, inplace=True)
    print(f'Class {i}')
    print(percentage)

In [ ]:
menorEdadByClass(df_titanic)

Class 1
            Percentage
Menor_Edad
0            93.548387
1             6.451613
Class 2
            Percentage
Menor_Edad
0            86.705202
1            13.294798
Class 3
            Percentage
Menor_Edad
0            78.028169
1            21.971831